/********************************* Copyright(c) ********************************
*
*                          LANMENG Scientific Creation
*                          https: //www.lmiracle.com
*
* File Name     : main.c
* Change Logs   :
* Date         Author      Notes
* 2019-06-07   terryall    V1.0    first version
*******************************************************************************/

/*******************************************************************************
* Description   : 文件包含区
*******************************************************************************/
#include "lm_app_config.h"
#include "lm_driver.h"
#include "lm_app.h"

#include "lm_clock.h"

/*******************************************************************************
* Description    : 模块内部函数声明区
*******************************************************************************/

/*******************************************************************************
* FunName       : lm_logo_show()
* Description   : 蓝梦平台信息展示
* EntryParam    : None
* ReturnValue   : None
*******************************************************************************/
static void lm_logo_show(void);

/*******************************************************************************
* Description    : 模块内部函数定义区
*******************************************************************************/

/*******************************************************************************
* FunName       : lm_logo_show()
* Description   : 蓝梦平台信息展示
* EntryParam    : None
* ReturnValue   : None
*******************************************************************************/
static void lm_logo_show(void)
{
    /* 1.硬件版本 */

    /* 2.软件版本 */

    return ;
}

/*******************************************************************************
* FunName       : lm_app_start()
* Description   : 用户程序启动
* EntryParam    : None
* ReturnValue   : None
*******************************************************************************/
static void lm_app_start(void)
{
    /* 1.库函数初始化 */
    HAL_Init();

    /* 2.初始化驱动模块 */
    lm_driver_all_init();

    /* 3.初始化应用程序 */
    lm_app_all_init();

    /* 4.显示用户logo */
    lm_logo_show();

    /* 5.任务轮训 */
    while (1) {
        lm_app_task_1s();
        lm_delay_ms(1000);
    }
}

/*******************************************************************************
* FunName       : main()
* Description   : 程序入口
* EntryParam    : None
* ReturnValue   : 错误码
*******************************************************************************/
int main(void)
{
    /* 1.启动用户程序 */
    lm_app_start();

    return -1;
}

/* end of file */
